Comment: Generic Policy Template
Identifier: com.sample.patch.thing
Input:
    NAME: SamplePatch
MinimumVersion: '2.3'
Process:
-   Processor: really.cool.processors/JamfPatchTitleVersioner
    Arguments:
        patch_softwaretitle: SampleApp
-   Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
    Arguments:
        pkg_name: RunTrigger-updateSampleApp.pkg
        version: '%latest_patch_version%'
        replace_patch: 'True'
        patch_template: YourFancyPatchTemplate.xml
        patch_name: SampleApp
        patch_softwaretitle: SampleApp
