<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Generic Policy Template</string>
	<key>Identifier</key>
	<string>com.sample.patch.thing</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SamplePatch</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>really.cool.processors/JamfPatchTitleVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>patch_softwaretitle</key>
				<string>SampleApp</string>
			</dict>
        </dict>
        <dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPatchUploader</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_name</key>
				<string>RunTrigger-updateSampleApp.pkg</string>
				<key>version</key>
				<string>%latest_patch_version%</string>
				<key>replace_patch</key>
				<string>True</string>
				<key>patch_template</key>
				<string>YourFancyPatchTemplate.xml</string>
				<key>patch_name</key>
				<string>SampleApp</string>
				<key>patch_softwaretitle</key>
				<string>SampleApp</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>